{
    "business": [
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/business/story/cognizant-sues-infosys-for-stealing-trade-secrets-indian-it-firm-denies-claims-2587186-2024-08-24",
        "headline": "Cognizant sues Infosys for stealing trade secrets, Indian IT firm denies claimsCognizant seeks damages and an injunction to stop Infosys from exploiting its trade secrets.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-speech-jackson-hole-conference-rate-cut-2587099-2024-08-23",
        "headline": "US stock markets soar as Fed Chair Jerome Powell signals imminent rate cutIn his speech at the Kansas City Fed's annual economic conference in Jackson Hole, Jerome Powell hinted that the time has come for policy adjustments."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-presidential-election-kamala-harris-presidential-campaign-2587055-2024-08-23",
        "headline": "'Time has come' to cut key interest rate after 23-year high, says US Fed ChairFed Chair Jerome Powell did not say when rate cuts would begin or how large they might be, but the Fed is widely expected to announce a modest quarter-point cut in its benchmark rate when it meets in mid-September."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/sebi-bans-anil-ambani-from-securities-market-for-5-years-key-points-explaind-2586936-2024-08-23",
        "headline": "Sebi bans Anil Ambani from securities market for 5 years: Story in 6 pointsIn its 222-page order, Sebi detailed how Anil Ambani and top RHFL executives executed a fraudulent scheme to divert funds by disguising them as loans to entities linked to Anil Ambani."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-bajaj-auto-global-cues-us-fed-jerome-powell-2586906-2024-08-23",
        "headline": "Sensex, Nifty end with marginal gains; Bajaj Auto jumps 5%The S&P BSE Sensex was up 33.02 points at 81,086.21 at the closing bell, while the NSE Nifty50 settled 11.65 points higher at 24,823.15."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/pernod-ricard-india-launches-two-premium-whiskies-aims-to-triple-revenue-2586890-2024-08-23",
        "headline": "Pernod Ricard launches two whiskies, aims to triple revenue over next decade The move is a crucial part of the company's plan to triple its revenue over the next decade by focusing on premium offerings and innovation in the Indian market."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/rvnl-irfc-ircon-railtel-why-these-railway-stocks-are-gaining-after-long-correction-multibagger-stocks-2586819-2024-08-23",
        "headline": "RVNL, IRFC, Ircon, RailTel: Why these railway stocks are gaining after long correctionMost analysts caution that while these railway stocks could see short-term gains, they remain volatile, and only investors with a long-term horizon should consider betting on them."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/zomato-shares-rise-4-today-will-the-bull-run-continue-brokerage-view-explained-2586769-2024-08-23",
        "headline": "Zomato shares rise 4% today. Will the bull run continue?The uptick in share price comes in the wake of Zomato's Rs 2,048 crore deal to acquire Paytm's entertainment ticketing business"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/reliance-industries-limited-shares-gain-ahead-of-annual-general-meeting-brokerage-views-target-price-2586746-2024-08-23",
        "headline": "Explained: Why Reliance shares gained ahead of upcoming AGMThe shares of the company rose as a result of increasing optimism from both domestic and global brokerage firms ahead of the company's Annual General Meeting (AGM) on August 29."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/sebi-trading-ban-anil-ambani-24-others-securities-market-5-years-2586698-2024-08-23",
        "headline": "Sebi imposes 5-year trading ban on Anil Ambani, fines him Rs 25 croreIn its 222-page final order, Sebi revealed that Anil Ambani and RHFL's top executives orchestrated a fraudulent scheme to divert funds from RHFL under the guise of loans to entities connected to him."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-global-markets-cautious-rvnl-irfc-2586671-2024-08-23",
        "headline": "Sensex, Nifty open flat as global markets cautious; RVNL, IRFC gainAmong individual stocks, shares of railway firms such as RVNL and IRFC rose sharply in early trade, with reports suggesting a possibility of a short-term rally."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/jackson-hole-symposium-2024-importance-global-markets-jerome-powell-chair-federal-reserve-september-rate-cut-2586455-2024-08-22",
        "headline": "Explained: Why Jackson Hole Symposium 2024 matters for global marketsJackson Hole Symposium has become a key platform where central bankers, economists, and policymakers from around the world come together to discuss the most pressing issues in global economics."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/fair-chance-for-small-retailers-union-minister-piyush-goyal-clarifies-stance-on-e-commerce-2586439-2024-08-22",
        "headline": "Piyush Goyal clarifies stance on e-commerce: Fair chance for small retailersHe said that the government aims to ensure that small retailers have a 'fair chance' to compete in the market. Goyal made this statement in an effort to address the confusion surrounding his earlier remarks."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/invested-in-debt-mutual-funds-before-april-2023-check-if-you-will-receive-indexation-benefit-budget-2024-changes-2586430-2024-08-22",
        "headline": "Invested in debt mutual funds pre-April 2023? See if you get indexation benefitPrior to April 2023, if you held debt mutual funds for more than three years, the gains were considered long-term and taxed at 20% after applying the indexation benefit."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/business/story/government-open-to-resolving-rs-32000-crore-tax-dispute-with-infosys-report-2586357-2024-08-22",
        "headline": "Government open to resolving Rs 32,000 crore tax dispute with Infosys: ReportThis follows a Rs 32,000 crore (approximately $3.9 billion) tax demand issued to Infosys in connection with unpaid taxes on expenses incurred by its overseas offices since 2017."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/food-inflation-grocery-shopping-bill-monsoon-good-harvest-2586320-2024-08-22",
        "headline": "Grocery bills set to decline as food inflation shows signs of coolingWith recent monsoon rains helping replenish water levels in reservoirs, a good harvest is expected to follow, which should help cool off the rising food prices that many households have been feeling lately."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-higher-as-fmcg-stocks-gain-grasim-rises-3-percent-2586287-2024-08-22",
        "headline": "Sensex, Nifty end marginally higher as FMCG stocks gain; Grasim rises 3%The S&P BSE Sensex gained 112.10 points to end at 81,053.19, while the NSE Nifty50 added 41.30 points to close at 24,811.50. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/byjus-insolvency-27000-jobs-in-danger-employees-scramble-for-dues-legal-battle-report-2586273-2024-08-22",
        "headline": "Byju's employees may sue firm over unpaid salaries as insolvency looms: ReportThe situation has left thousands of Byju's employees in a precarious position. Many have not been paid for months, leading to mounting frustration and anxiety."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/business/story/clsa-shares-stock-price-target-for-vedanta-is-it-worth-a-buy-outlook-analyst-review-2586242-2024-08-22",
        "headline": "CLSA shares stock price target for Vedanta. Is it worth a buy?Vedanta's shares have risen by 1.4% over the last month and have increased by 77% year-to-date"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/business/story/rvnl-share-price-recovery-rally-short-term-investors-trading-strategy-stoxbox-2586218-2024-08-22",
        "headline": "Is RVNL stock gearing up for a short-term rally?RVNL share price: At 1:48 pm, RVNL shares were up 0.95% at Rs 569.10 on the Bombay Stock Exchange (BSE)."
      }
    ],
    "entertainment": [
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
        "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
        "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\n\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\n\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\n\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
        "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \n\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\n\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
        "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\n"
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
        "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\n\n"
      }
    ],
    "General News": [
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/pm-modi-ukraine-visit-volodymyr-zelenskyy-what-to-expect-2586576-2024-08-23",
        "headline": "PM Modi says peace is our side, Zelenskyy says want India on our sidePM Modi, who is in Kyiv on a historic visit to Ukraine, urged dialogue and diplomacy to end the war with Russia. PM Modi said that New Delhi is ready to make proactive contributions towards efforts for peace."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-retirement-legacy-mr-icc-grace-india-legend-2587199-2024-08-24",
        "headline": "With grit and grace, 'Gabbar' Shikhar Dhawan entertained and carved his legacyShikhar Dhawan retires: The India opener gave it his all in a decorated 14-year-long international career. He had fun while doing so. Having made a first mark in Tests, Dhawan went on to become one of the finest modern-day openers in ODI cricket.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/law/story/supreme-court-release-undertrials-order-section-479-bnss-overcrowding-jails-2587206-2024-08-24",
        "headline": "Top court fast-tracks release process of undertrials who served one-third of termThe Supreme Court directed the superintendent of jails across the country to process the applications of the eligible undertrials within three months. "
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/business/story/cognizant-sues-infosys-for-stealing-trade-secrets-indian-it-firm-denies-claims-2587186-2024-08-24",
        "headline": "Cognizant sues Infosys for stealing trade secrets, Indian IT firm denies claimsCognizant seeks damages and an injunction to stop Infosys from exploiting its trade secrets.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/television/celebrity/story/uorfi-javed-bold-interview-on-her-life-story-struggle-ambitions-i-want-to-rule-like-shah-rukh-khan-exclusive-2587181-2024-08-24",
        "headline": "Uorfi Javed's story, brazen and unfiltered: I want to rule like SRK | ExclusiveUorfi Javed has risen, and she is here to stay. She would do anything to be \"very very famous\". In an exclusive interview with us, she tells her story, answers who she is and when she will stop. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/pm-modi-invites-vladimir-zelenskyy-ukrainian-president-india-during-ukraine-trip-2587177-2024-08-24",
        "headline": "PM Modi invites Ukraine's Volodymyr Zelenskyy to visit India, he replies...Prime Minister Narendra Modi has invited Ukrainian President Volodymyr Zelenskyy to visit India during his historic visit to the European nation, which saw the two leaders engage in wide-ranging diplomatic talks."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/music/story/justin-bieber-hailey-bieber-welcome-baby-boy-share-first-pic-2587182-2024-08-24",
        "headline": "Justin Bieber-Hailey Bieber welcome baby boy, share first picJustin Bieber and his wife, Hailey Bieber, have welcomed their first child. The singer revealed his baby boy's name."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/india/story/assam-gangrape-accused-escapes-police-custody-dies-after-jumping-into-pond-2587171-2024-08-24",
        "headline": "Assam gangrape accused escapes police custody, dies after jumping into pondThe prime accused in a gangrape case in Assam died while attempting to escape police custody on Saturday, authorities said. Tafazul Islam was arrested on Friday in connection with the brutal assault on a 14-year-old girl in Nagaon district."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/movies/regional-cinema/story/decoding-portrayal-of-sexual-abuse-in-tamil-cinema-voyeurism-sensitive-treatment-maharaja-chithha-gargi-paruthiveeran-kaala-pink-2586766-2024-08-24",
        "headline": "Tamil cinema's take on sexual abuse: Is it sensitivity or voyeurism?Depicting sexual violence on screen is a tricky and sensitive task. Directors and an activist spoke to IndiaToday.in to explain the reasons behind their creative choices and the impact these portrayals have on society.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/impact-feature/story/sathyabama-institute-of-science-and-technology-deemed-to-be-university-33rd-convocation-learn-today-lead-tomorrow-2585709-2024-08-21",
        "headline": "Sathyabama Institute of Science and Technology's 33rd convocation: Learn today, lead tomorrow4152 (UG-3508, PG-644,) STUDENTS RECEIVED THE DEGREES AT THE 33rd CONVOCATION CEREMONY THAT WAS HELD ON 18th August, 2024 AT SATHYABAMA CAMPUS"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/new-moms-head-to-postpartum-care-centres-a-trend-india-is-catching-up-with-2586359-2024-08-24",
        "headline": "New moms head to postpartum care centres, a trend India is embracingAs part of a new mother's postpartum care, she needs more than just a mother or midwife to cater to her needs. That's where postpartum care centres come into the picture."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/india-government-fixed-combination-drugs-cold-fever-pain-allergies-dtab-2587085-2024-08-23",
        "headline": "India bans 156 combination drugs used to treat fever, cold, allergiesThe Centre has banned 156 fixed-dose combination (FDC) drugs, including antibacterial medicines, used to treat cold, allergies, fever and pain, after the combinations were found to pose risks to human health."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-saree-brother-siddharth-chopra-wedding-mumbai-2587173-2024-08-24",
        "headline": "Priyanka Chopra stuns in saree at brother's wedding festivities in MumbaiPriyanka Chopra was a part of her brother, Siddharth Chopra's wedding festivities in Mumbai on August 23. She looked stunning in a saree. "
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/india/story/pm-modi-ukraine-president-zelenskyy-hug-russia-vladimir-putin-gesture-2586853-2024-08-23",
        "headline": "The story of two hugs in Russia and Ukraine, six weeks apartModi-Zelensky meet: The hand over the shoulder gesture is being seen as PM Modi's assurance of India's solidarity with Ukraine amid a fierce Russian assault."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/india/story/bengali-actor-payel-mukherjee-attacked-car-biker-accident-kolkata-police-case-filed-arrest-2587165-2024-08-24",
        "headline": "Bengali actor Payel Mukherjee 'assaulted' by biker, car vandalised in KolkataThe biker reportedly stopped Payel Mukherjee's car and began shouting at her. He allegedly punched the car's window, breaking the glass, and attempted to attack her."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/story/shikhar-dhawan-announces-retirement-from-international-domestic-cricket-says-thank-you-for-all-love-and-support-2587168-2024-08-24",
        "headline": "Shikhar Dhawan, Mr. ICC, retires from international and domestic cricketStar India batter Shikhar Dhawan announced his retirement from international and domestic cricket on Saturday, August 24. Dhawan made his international debut in 2010 and last played for the country in December 2022."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-seeks-name-change-after-filing-for-divorce-from-ben-affleck-2587118-2024-08-23",
        "headline": "Jennifer Lopez seeks name change after filing for divorce: ReportSinger-actor Jennifer Lopez has reportedly requested a name change after filing for divorce from Hollywood star Ben Affleck.  Lopez filed for divorce on August 20, according to reports."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/cities/delhi/story/delhi-kasturba-gandhi-hospital-infant-death-power-cut-mayor-shelly-oberoi-probe-mcd-2587172-2024-08-24",
        "headline": "Infant dies during planned power cut at Delhi hospital, Mayor orders probeThis incident came under the spotlight after several social media users claimed that on Thursday, there was a power cut at the civic-run Kasturba Hospital during which two newborns were allegedly delivered under torchlight. One of the infants died during the delivery. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/world/story/ukraine-volodymr-zelenskyy-pm-modi-meeting-russia-war-india-balancing-act-2587067-2024-08-23",
        "headline": "Want India on our side to end war, not do balancing act: Ukraine's ZelenskyyVolodymyr Zelenskyy's remarks came after he held one-on-one and delegation-level talks with Prime Minister Narendra Modi, who arrived in Kyiv amid the ongoing Russia-Ukraine war."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/kolkata-rape-murder-case-accused-sanjay-roy-mother-interview-2587049-2024-08-23",
        "headline": "Mother of Kolkata rape accused Sanjay Roy: 'My daughters have abandoned me'Speaking exclusively to India Today TV, the mother of Kolkata rape accused Sanjay Roy said she had not seen her son since the incident. She said her daughters have not visited their home since then."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/history-of-it/story/india-jawaharlal-nehru-prime-minister-korean-war-end-peace-armistice-pows-pm-modi-ukraine-visit-zelenskyy-russia-2586797-2024-08-23",
        "headline": "When Nehru helped end a bloody warAs PM Narendra Modi visits Ukraine, in the thick of the Russia-Ukraine war, there is talk about how he can mediate in the crisis. History has shown how Indian PMs can actually help stop a war. Jawaharlal Nehru, despite being eyed with suspicion by the West, helped end the Korean War with an armistice."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/bholanath-pandey-up-mla-congress-indira-gandhi-release-emergency-flight-hijack-varanasi-delhi-2587109-2024-08-23",
        "headline": "Congress leader, who 'hijacked' plane for Indira Gandhi's release, diesBholanath Pandey, senior Congress leader Bholanath Pandey and former Uttar Pradesh MLA, who once 'hijacked' an Indian Airlines plane with a toy gun in 1978 to demand Indira Gandhi's release, died at the age of 71."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/video/video-pune-family-visits-tirumala-temple-wearing-25-kg-gold-2587162-2024-08-24",
        "headline": "Video: Pune family visits Tirumala Temple wearing 25 kg goldA family from Pune on Friday visited Tirumala's Sri Venkateswara Swami temple wearing 25 kg of golden ornaments. In the video, the family of four can be seen standing with folded hands. Two men in white vests and dhotis are seen with thick chains around their necks, and a woman in a golden saree can be seen covered in jewellery. A child is also seen standing in front of the adults. This temple, located in the Tirupati district of Andhra Pradesh, is nestled amid a dense forest. It is considered one of the holiest places by the followers of Hinduism."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/yogi-adityanath-best-performing-chief-minister-popularity-dips-mood-of-the-nation-survey-2587074-2024-08-23",
        "headline": "Yogi Adityanath best-performing Chief Minister but popularity dips: SurveyIn terms of popularity, Yogi Adityanath seems to have lost ground, with a massive 12 percentage point dip from the MOTN survey conducted before the Lok Sabha polls."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/movies/regional-cinema/story/decoding-portrayal-of-sexual-abuse-in-tamil-cinema-voyeurism-sensitive-treatment-maharaja-chithha-gargi-paruthiveeran-kaala-pink-2586766-2024-08-24",
        "headline": "Tamil cinema's take on sexual abuse: Is it sensitivity or voyeurism?Depicting sexual violence on screen is a tricky and sensitive task. Directors and an activist spoke to IndiaToday.in to explain the reasons behind their creative choices and the impact these portrayals have on society.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/television/celebrity/story/uorfi-javed-bold-interview-on-her-life-story-struggle-ambitions-i-want-to-rule-like-shah-rukh-khan-exclusive-2587181-2024-08-24",
        "headline": "Uorfi Javed's story, brazen and unfiltered: I want to rule like SRK | ExclusiveUorfi Javed has risen, and she is here to stay. She would do anything to be \"very very famous\". In an exclusive interview with us, she tells her story, answers who she is and when she will stop. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalki-director-nag-ashwin-breaks-silence-arshad-warsi-joker-comment-prabhas-2587188-2024-08-24",
        "headline": "'Kalki' director reacts to Arshad Warsi's 'joker' comment for PrabhasDirector Nag Ashwin addressed Arshad Warsi's comment on Prabhas' role in 'Kalki 2898 AD'. He also advocated for a united Indian film industry."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/music/story/justin-bieber-hailey-bieber-welcome-baby-boy-share-first-pic-2587182-2024-08-24",
        "headline": "Justin Bieber-Hailey Bieber welcome baby boy, share first picJustin Bieber and his wife, Hailey Bieber, have welcomed their first child. The singer revealed his baby boy's name."
      }
    ],
    "sports": [
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/football/story/premier-league-chelsea-boss-enzo-maresca-hints-at-moving-for-another-striker-before-deadline-2587103-2024-08-23",
        "headline": "Chelsea boss Enzo Maresca hints at moving for another striker before deadlineChelsea boss Enzo Maresca has hinted that the club could make the move to sign another striker before the deadline. Chelsea have been once again busy in the market for signings. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/three-super-overs-in-a-single-t20-game-hubli-clinch-thriller-over-bengaluru-2587102-2024-08-23",
        "headline": "Three Super Overs in a single T20 game? Hubli clinch thriller over BengaluruHubli Tigers secured a historic victory over Bengaluru Blasters in an unprecedented triple super-over thriller. Manvanth Kumar was the standout performer, contributing crucial runs and taking 4 wickets, including decisive actions in the super overs.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-part-ways-with-trainer-and-physiotherapist-after-doping-controversy-2587081-2024-08-23",
        "headline": "Jannik Sinner parts ways with trainer and physiotherapist after doping controversyJannik Sinner splits with trainer Umberto Ferrara and physiotherapist Giacomo Naldi. He was caught up in a doping controversy after testing positive twice for the banned anabolic steroid Clostebol."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/other-sports/story/valentina-petrillo-to-become-first-openly-transgender-athlete-at-paralympics-2587075-2024-08-23",
        "headline": "Valentina Petrillo to become first openly transgender athlete at ParalympicsValentina Petrillo, at 50, will be the first openly transgender woman to compete in the Paralympics, participating in the T12 classification for visually impaired athletes. Valentina overcame societal challenges and a degenerative eye condition to reach this milestone."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/watch-ben-stokes-doppelganger-re-appears-wearing-england-jersey-captain-reacts-2587071-2024-08-23",
        "headline": "Watch: Ben Stokes' doppelganger re-appears wearing England jersey, captain reactsBen Stokes' doppelganger re-appeared wearing an England jersey in the Manchester Test. The captain gave a priceless reaction. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/other-sports/story/pr-sreejesh-r-ashwin-retirement-dream-paris-olympics-2587063-2024-08-23",
        "headline": "Hockey great Sreejesh chats with Ashwin, reflects on 'dream ending' to careerHockey great PR Sreejesh reflected on his decision to retire from the sport after the Paris Olympics. Sreejesh said he contemplated carrying on for two more years, but changed his mind before the Games. The celebrated goalkeeper hung up his boots after winning a second successive Olympic bronze medal. "
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-dinesh-chandimal-retires-hurt-hit-thumb-wood-bouncer-2587062-2024-08-23",
        "headline": "Dinesh Chandimal retires hurt after being hit on thumb by Wood bouncerSri Lankan wicketkeeper Dinesh Chandimal was forced to retire hurt after being struck on the thumb by a bouncer from England's Mark Wood during the first Test at Old Trafford. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/paris-olympics-2024/story/watch-indias-para-archery-contingent-training-hard-ahead-of-paralympics-2024-2587054-2024-08-23",
        "headline": "Watch: India's para-archery contingent training hard ahead of Paralympics 2024India's para-archery team has been training hard in Paris. The 84-member Indian contingent will take part in the Pars Paralympics 2024, starting August 28. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/watch-ben-stokes-doppelganger-re-appears-wearing-england-jersey-captain-reacts-2587071-2024-08-23",
        "headline": "Watch: Ben Stokes' doppelganger re-appears wearing England jersey, captain reactsBen Stokes' doppelganger re-appeared wearing an England jersey in the Manchester Test. The captain gave a priceless reaction. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/other-sports/story/pr-sreejesh-r-ashwin-retirement-dream-paris-olympics-2587063-2024-08-23",
        "headline": "Hockey great Sreejesh chats with Ashwin, reflects on 'dream ending' to careerHockey great PR Sreejesh reflected on his decision to retire from the sport after the Paris Olympics. Sreejesh said he contemplated carrying on for two more years, but changed his mind before the Games. The celebrated goalkeeper hung up his boots after winning a second successive Olympic bronze medal. "
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-sl-dinesh-chandimal-retires-hurt-hit-thumb-wood-bouncer-2587062-2024-08-23",
        "headline": "Dinesh Chandimal retires hurt after being hit on thumb by Wood bouncerSri Lankan wicketkeeper Dinesh Chandimal was forced to retire hurt after being struck on the thumb by a bouncer from England's Mark Wood during the first Test at Old Trafford. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/paris-olympics-2024/story/watch-indias-para-archery-contingent-training-hard-ahead-of-paralympics-2024-2587054-2024-08-23",
        "headline": "Watch: India's para-archery contingent training hard ahead of Paralympics 2024India's para-archery team has been training hard in Paris. The 84-member Indian contingent will take part in the Pars Paralympics 2024, starting August 28. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/football/story/premier-league-ilkay-gundogan-manchester-city-return-pep-guardiola-2587046-2024-08-23",
        "headline": "Ilkay Gundogan's Manchester City return a 'surprise, unexpected': Pep GuardiolaManchester City boss Pep Guardiola has claimed that Ilkay Gundogan's return to the club was a surprise and unexpected. Gundogan completed his return to City on a free transfer from Barcelona on August 23, Friday. "
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-1st-test-day-3-report-mushfiqur-litton-shadmam-2587035-2024-08-23",
        "headline": "Mushfiqur, Litton cut down deficit to push Pakistan back Bangladesh's Mushfiqur Rahim and Litton Das scored defiant fifties to lead their team's fightback against Pakistan on the third day of the first Test in Rawalpindi. The series opener remained balanced as Bangladesh ended the day at 316 for 5, trailing by 132 runs."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/not-many-takers-as-pcb-sells-broadcast-rights-for-nearly-half-of-reserve-price-2587032-2024-08-23",
        "headline": "Not many takers as PCB sells broadcast rights for nearly half of reserve priceThe Pakistan Cricket Board has settled for nearly half of its reserve price kept for selling broadcasting rights for the international home matches between the period of August 2024 and December 2026."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-t20-central-delhi-kings-thrash-purani-dilli-6-by-109-runs-2587028-2024-08-23",
        "headline": "Delhi Premier League T20: Central Delhi Kings thrash Purani Dilli 6 by 109 runsCentral Delhi Kings thrashed Purani Dilli 6 by 109 runs in a one-sided affair on August 23, Friday. Sumit Kumar led the charge by taking 4 wickets for 22 runs as Central Delhi Kings bowlers cleaned up Purani Dilli 6. "
      }
    ],
    "education": [
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
        "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\n\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
        "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
        "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
        "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\n"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
        "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\n\n"
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
        "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
        "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
        "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
        "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
        "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
        "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
        "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
        "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
      },
      {
        "sentiment": "positive",
        "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
        "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
        "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
      },
      {
        "sentiment": "negative",
        "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
        "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
      }
    ]
  }